import streamlit as st

def render_sidebar_help():
    """Renders a brief help guide in the sidebar."""
    with st.sidebar.expander("ℹ️ Ինչպե՞ս օգտվել"):
        st.markdown("""
        
        1. **Ընտրեք բաժինը** 
            - ձախ մենյուից՝ տվյալ թեմայով տվյալները դիտելու համար:
            - ձախ մենյուն կարելի է փակել՝ մենյուի վերևի աջ կոճակով
        2. **Ֆիլտրեր**
            - Գտնվում են բոլոր բաժինների ամենավերևում՝
            - Գործում են միաժամանակ բոլոր բաժինների համար
        3. **Գրաֆիկներ**՝
           - Մկնիկը պահեք գրաֆիկի վրա՝ մանրամասներ տեսնելու համար:
           - Գրաֆիկները ինտերակտիվ են:
        4. **Աղյուսակներ**՝
           - "Բացել աղյուսակը"՝ տվյալները աղյուսակային տեսքով դիտելու և 
           - ներբեռնելու (CSV) համար:
           - սորթավորելու համար
           - Search անելու համար
        5. **Մենյուի հնարավորություններ** (վերևի աջ անկյունում)՝
           - **Rerun**: Թարմացնել էջը:
           - **Settings**: Կարգավորումներ (օրինակ՝ թեմայի փոփոխություն):
           - **Print**: Տպել էջը:
           - **Record a screencast**: Ձայնագրել էկրանը:
           - **Clear cache**: Մաքրել հիշողությունը (եթե տվյալները չեն թարմացվում):
        """)

